# DATAFRAME
---

A DataFrame is a 2-dimensional data structure of rows and columns, similar to a spreadsheet.

## Creating DataFrame from Lists

You can create a DataFrame by adding columns in the data structure. Each column is created from a collection of data represented as a list.

In [19]:
import pandas as pd

In [20]:
#creating an empty DataFrame
company = pd.DataFrame()

# creating data collections as lists
company_months = ['January','February','March']
company_income = [23500,19700,31150]

# adding columns to DataFrame
company['Month'] = company_months
company['Income'] = company_income

# displaying DataFrame contents
company

      Month  Income
0   January   23500
1  February   19700
2     March   31150

### Tasks

Complete the data by adding the remaining months of the first half of the year and the income earned in these months. Then, display the data again.

In [21]:
# `company_months
# company_months.append('April')
# company_months.append('May')
# company_months.append('June')
# company_months.append('July')
# company_months.append('August')
# company_months.append('September')
# company_months.append('October')
# company_months.append('November')
# company_months.append('December')
# company_income.append(42000)
# company_months.append(51000)
# company_months.append(52000)
# company_months.append(53000)
# company_months.append(54000)
# company_months.append(61000)
# company_months.append(62000)
# company_months.append(64000)
# company_months.append(66600)

months = ['April',
'May',
'June',
'July',
'August',
'September',
'October',
'November',
'December']
income = [42000,
51000,
52000,
53000,
54000,
61000,
62000,
64000,
66600]
compn = pd.DataFrame(data={'Month':months,'Income':income})

#company['Month'] = company_months
#company['Income'] = company_income
company = pd.concat([company,compn], ignore_index=True)

company

        Month  Income
0     January   23500
1    February   19700
2       March   31150
3       April   42000
4         May   51000
5        June   52000
6        July   53000
7      August   54000
8   September   61000
9     October   62000
10   November   64000
11   December   66600

Display descriptive statistics for income earned.

In [22]:
company.describe()

             Income
count     12.000000
mean   48329.166667
std    15876.575918
min    19700.000000
25%    39287.500000
50%    52500.000000
75%    61250.000000
max    66600.000000

Display company income for the months of the second quarter.

In [23]:
company.loc[3:5,:]

   Month  Income
3  April   42000
4    May   51000
5   June   52000

Display descriptive statistics for the income earned in the months of the second quarter.

In [24]:
company.loc[3:5,:].describe()

             Income
count      3.000000
mean   48333.333333
std     5507.570547
min    42000.000000
25%    46500.000000
50%    51000.000000
75%    51500.000000
max    52000.000000

## Creating DataFrame from 2D List

Instead of adding each column separately, you can create a DateFrame based on a two-dimensional (2D) list. Note that you will then need to add names to the columns you create.

In [25]:
# creating data collection as 2D list
company_data = [
    ['January',23500],
    ['February',19700],
    ['March',31150]
    ]

# creating DataFrame with column names
company = pd.DataFrame(data=company_data, columns=['Month','Income'])

# displaying DataFrame contents
company

      Month  Income
0   January   23500
1  February   19700
2     March   31150

### Tasks

The table below lists the university's students. 

StudentID | Name        | Surname      | Age | Program
----------|-------------|--------------|-----|-----------
902311    | Peter       | Red          | 21  | Accounting   
915027    | Sofia       | White        | 19  | Computer Science
900004    | Jack        | Grey         | 24  | Accounting
994031    | Mark        | Brown        | 22  | Engineering

Create a DataFrame using a 2D list. Then, display the contents of the DataFrame.

In [26]:

table = [[902311    , "Peter"       , "Red"          , 21  , "Accounting"   ],
[915027    , "Sofia"       , "White"        , 19  , "Computer Science"],
[900004    , "Jack"        , "Grey"         , 24  , "Accounting"],
[994031    , "Mark"        , "Brown"        , 22  , "Engineering"]]
labels = ["StudentID" , "Name"        , "Surname"      , "Age" , "Program"]
unis = pd.DataFrame(data=table,columns=labels)
unis

   StudentID   Name Surname  Age           Program
0     902311  Peter     Red   21        Accounting
1     915027  Sofia   White   19  Computer Science
2     900004   Jack    Grey   24        Accounting
3     994031   Mark   Brown   22       Engineering

Calculate and display the average age of students.

In [27]:
unis.loc[:,"Age"].mean()

21.5

## Creating DataFrame from Dictionary

As you know, a dictionary contains data consisting of key and value pairs of information, separated by a colon. Each pair of information represents one column in the DataFrame. The key is the name of the column and the value is the data collection (list). Below is an example of creating a DataFrame based on a dictionary.

In [40]:
# creating data collection as a dictionary
company_data = {
    'Month':['January','February','March'],
    'Income':[23500,19700,31150]
    }

#creating DataFrame
company = pd.DataFrame(data=company_data)

#displaying DataFrame contents
company

      Month  Income
0   January   23500
1  February   19700
2     March   31150

### Tasks

Complete the DataFrame by adding a 'Tax' column along with the following values: 1200, 2350, 995. Then, display DataFrame contents.

In [41]:
tax = {"Tax":[1200,2350,995]}
tax = pd.DataFrame(tax)
company = pd.concat([tax,company],ignore_index=True, axis=1)
company.columns = ['Tax','Month','Income']
company

    Tax     Month  Income
0  1200   January   23500
1  2350  February   19700
2   995     March   31150

Display descriptive statistics for the company income and tax.

In [42]:
company.describe()

               Tax        Income
count     3.000000      3.000000
mean   1515.000000  24783.333333
std     730.359501   5831.880772
min     995.000000  19700.000000
25%    1097.500000  21600.000000
50%    1200.000000  23500.000000
75%    1775.000000  27325.000000
max    2350.000000  31150.000000

## Creating DataFrame from File

Creating a DataFrame based on the data contained in a CSV file is incredibly simple. All you need to do is use the read_csv() function.

In [29]:
sales = pd.read_csv('product_sales.csv')
sales

            SaleRep Region  Orders  TotalSales
0      Felice Lunck   West     218       44489
1    Doralynn Pesak   West     233       61035
2  Madelle Martland   East     264       62603
3      Yasmin Myhan  South     110       59377
4   Marmaduke Webbe   East     188       78771
5   Christiano Vero   East     265       68506
6   Cecelia Jealous   West      93       53634
7    Isaak Housiaux   East     189       62455
8    Derril Howland   East     385       73460
9       Judon Allom   West     230       51067

### Tasks

For sales data, calculate and display the average number of orders.

In [43]:
sales.loc[:,'Orders'].mean()

217.5

For sales data, calculate and display the total sales value.

In [44]:
sales.loc[:,'TotalSales'].sum()

615397